Repository: murad-o/MadeInRd
Catalog: ExporterWeb/Resources/ErrorsResources.*.resx
Languages: ru

source: User Name {0} is already taken.
ru: Имя пользователя {0} занято

source: An unknown failure has occurred.
ru: Произошла неизвестная ошибка

source: Incorrect password.
ru: Неправильный пароль

source: A user with this login already exists.
ru: Пользователь с таким логином уже существует

source: User name '{userName}' is invalid, can only contain letters or digits.
ru: Имя пользователя {userName} не валидно. Имя пользователя может содержать только цифры и буквы

source: Email {0} is already taken.
ru: Почта {0} уже занята

source: Email '{email}' is invalid.
ru: Введите действительный адрес

source: Passwords must be at least {length} characters.
ru: Пароль должен быть длинее {length} символов

source: Passwords must have at least one non alphanumeric character.
ru: Пароль должен содержать как минимум один не буквенно-цифровой символ

source: Passwords must have at least one digit ('0'-'9').
ru: Пароль должен содержать хотя бы одну цифру ('0'-'9')

source: Passwords must have at least one lowercase ('a'-'z').
ru: Пароль должен содержать хотя бы одну строчную букву ('z'-'z')

source: Passwords must have at least one uppercase ('A'-'Z').
ru: Пароль должен содержать хотя бы одну заглавную букву ('A'-'Z').

source: This field is required
ru: Это обязательное поле

source: The password and confirmation password do not match.
ru: Пароли не совпадают

source: The {0} must be at least {2} and at max {1} characters long.
ru: Длина поля {0} должна быть в диапозоне {2}-{1}

source: Invalid email address
ru: Некорректный формат адреса электронной почты

source: {0} length should not be more than {2}
ru: Длина {0} не может быть длинеее, чем {2}

source: {0} must be {1} characters long
ru: {0} должен иметь длину {1}

source: Your consent to the user agreement is required
ru: Необходимо ваше согласие с пользовательским соглашением
